Revit 2027 API
BuiltInFailures.GeneralFailures.GenericError Property
 Error.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GenericError { get; }
Public Shared ReadOnly Property GenericError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GenericError {
	FailureDefinitionId^ get ();
}
static member GenericError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace